In [2]:
import os
import pandas as pd



dfCars = pd.read_csv('cars.txt','\t',lineterminator='\n') 

dfCustomers = pd.read_csv('customers.txt', sep='\t', lineterminator='\n')

dfSalespersons = pd.read_csv('salespersons.txt', sep='\t', lineterminator='\n')

dfInvoices = pd.read_csv('invoices.txt', sep='\t', lineterminator='\n')

In [3]:
display(dfCars)

   ID                VIN Manufacturer              Model  Year   Color
0   0  3K096I98581DHSNUP   Volkswagen             Tiguan  2019    Blue
1   1  ZM8G7BEUQZ97IH46V      Peugeot             Rifter  2019     Red
2   2  RKXVNNIHLVVZOUB4M         Ford             Fusion  2018   White
3   3  HKNDGS7CU31E9Z7JW       Toyota               RAV4  2018  Silver
4   4  DAM41UDN3CHU2WVF6        Volvo                V60  2019    Gray
5   5  DAM41UDN3CHU2WVF6        Volvo  V60 Cross Country  2019    Gray

In [4]:
display(dfCustomers)

,ID,Customer ID,Name,Phone,Email,Address,City,State/Province,Country,Postal
0,0,10001,Pablo Picasso,+34 636 17 63 82,-,"Paseo de la Chopera, 14",Madrid,Madrid,Spain,28045
1,1,20001,Abraham Lincoln,+1 305 907 7086,-,120 SW 8th St,Miami,Florida,United States,33130
2,2,30001,Napoléon Bonaparte,+33 1 79 75 40 00,-,40 Rue du Colisée,Paris,Île-de-France,France,75008

In [5]:
display(dfSalespersons)

   ID  Staff ID            Name        Store
0   0         1   Petey Cruiser       Madrid
1   1         2    Anna Sthesia    Barcelona
2   2         3     Paul Molive       Berlin
3   3         4  Gail Forcewind        Paris
4   4         5    Paige Turner        Mimia
5   5         6    Bob Frapples  Mexico City
6   6         7    Walter Melon    Amsterdam
7   7         8     Shonda Leer    São Paulo

In [6]:
display(dfInvoices)

   ID  Invoice Number        Date  Car  Customer  Sales Person
0   0       852399038  22-08-2018    0         1             3
1   1       731166526  31-12-2018    3         0             5
2   2       271135104  22-01-2019    2         2             7

In [10]:
carsL = dfCars.values.tolist()
print(carsL)
#flatCars = [item for item in carsL for item in item]

[[0, '3K096I98581DHSNUP', 'Volkswagen', 'Tiguan', 2019, 'Blue'], [1, 'ZM8G7BEUQZ97IH46V', 'Peugeot', 'Rifter', 2019, 'Red'], [2, 'RKXVNNIHLVVZOUB4M', 'Ford', 'Fusion', 2018, 'White'], [3, 'HKNDGS7CU31E9Z7JW', 'Toyota', 'RAV4', 2018, 'Silver'], [4, 'DAM41UDN3CHU2WVF6', 'Volvo', 'V60', 2019, 'Gray'], [5, 'DAM41UDN3CHU2WVF6', 'Volvo', 'V60 Cross Country', 2019, 'Gray']]

In [18]:
customerL = dfCustomers.values.tolist()
print(customerL)
cust = str(customerL)
cust2 = cust.replace('[','(')
print(cust2.replace(']',')'))
#[item for item in customerL for item in item]

[[0, 10001, 'Pablo Picasso', '+34 636 17 63 82', '-', 'Paseo de la Chopera, 14', 'Madrid', 'Madrid', 'Spain', 28045], [1, 20001, 'Abraham Lincoln', '+1 305 907 7086', '-', '120 SW 8th St', 'Miami', 'Florida', 'United States', 33130], [2, 30001, 'Napoléon Bonaparte', '+33 1 79 75 40 00', '-', '40 Rue du Colisée', 'Paris', 'Île-de-France', 'France', 75008]]
((0, 10001, 'Pablo Picasso', '+34 636 17 63 82', '-', 'Paseo de la Chopera, 14', 'Madrid', 'Madrid', 'Spain', 28045), (1, 20001, 'Abraham Lincoln', '+1 305 907 7086', '-', '120 SW 8th St', 'Miami', 'Florida', 'United States', 33130), (2, 30001, 'Napoléon Bonaparte', '+33 1 79 75 40 00', '-', '40 Rue du Colisée', 'Paris', 'Île-de-France', 'France', 75008))

In [12]:
salesPersons= dfSalespersons.values.tolist() 
print(salesPersons)
#[item for item in salesPersons for item in item]

[[0, 1, 'Petey Cruiser', 'Madrid'], [1, 2, 'Anna Sthesia', 'Barcelona'], [2, 3, 'Paul Molive', 'Berlin'], [3, 4, 'Gail Forcewind', 'Paris'], [4, 5, 'Paige Turner', 'Mimia'], [5, 6, 'Bob Frapples', 'Mexico City'], [6, 7, 'Walter Melon', 'Amsterdam'], [7, 8, 'Shonda Leer', 'São Paulo']]